#+TITLE: config
#+TODO: ADDME FIXME TWEAKME | ADDED FIXED TWEAKED

*** Hook
#+BEGIN_SRC emacs-lisp
  (defun code-features-hook ()
    (lsp-mode)
    (company-mode)
    (global-unset-key (kbd "TAB"))
    (global-set-key (kbd "TAB") 'company-indent-or-complete-common))
  (add-hook 'c-mode-common-hook 'code-features-hook)

#+END_SRC

#+RESULTS:
| (lambda nil (c-set-offset 'innamespace 0) (setq prettify-symbols-alist (cons '(std:: . ) prettify-symbols-alist)) (setq prettify-symbols-alist (cons '(Eigen:: . ) prettify-symbols-alist))) | code-visuals-hook | code-features-hook |

